Repository: leksah/leksah
Catalog: po/*.po
Languages: pt_br

source: Location
pt_br: Localização

source: Remove breakpoint
pt_br: Remover breakpoint

source: Debugger>> breakpointViewPopup: no selection2
pt_br: Depurador>> breakpointViewPopup: não há selection2

source: Remove all breakpoints
pt_br: Remover todos os breakpoints

source: Update
pt_br: Atualizar

source: Debugger>>deleteBreakpoint: Not a breakpoint
pt_br: Depurador>>deleteBreakpoint: Não é um breakpoint

source: Errors
pt_br: Erros

source: Description
pt_br: Descrição

source: Resolve Errors
pt_br: Resolver Erros

source: Files
pt_br: Arquivos

source: File
pt_br: Arquivo

source: Unexpected Expansion in Files Pane
pt_br: Expansão inesperada no painel Arquivos

source: Unexpected Activation in Files Pane
pt_br: Ativação inesperada no painel Arquivos

source: Unexpected Selection in Files Pane
pt_br: Seleção inesperada no painel Arquivos

source: Line
pt_br: Linha

source: Context
pt_br: Contexto

source: (Stoped Searching)
pt_br: (Busca parada)

source: Search Complete
pt_br: Busca Completada

source: Unexpected Expansion in HLint Pane
pt_br: Expansão inesperada no painel HLint

source: Goto Definition
pt_br: Ir para definição

source: Select Module
pt_br: Selecionar Módulo

source: Open Documentation
pt_br: Abrir Documentação

source: Terminate process
pt_br: Terminar processo

source: Remove launch
pt_br: Remover lançamento

source: Can't init log
pt_br: Não foi possível iniciar log

source: Run external called with args %s
pt_br: Executar chamada externa com args %s

source: Starting external tool: %s with args %s
pt_br: Inicializando ferramenta externa: %s com args %s

source: Modules
pt_br: Módulos

source: Module
pt_br: Módulo

source: Package
pt_br: Pacote

source: Workspace
pt_br: Área de Trabalho

source: System
pt_br: Sistema

source: Imports
pt_br: Importa

source: Blacklist
pt_br: Lista negra

source: no path found
pt_br: caminho não encontrado

source: Modules>>insertNodesInTree: Should not happen2
pt_br: Modules>>insertNodesInTree: Não deveria acontecer happen2

source: Impossible in makeNodes
pt_br: Impossível em makeNodes

source: Edit source
pt_br: Editar fonte

source: Expand here
pt_br: Expandir aqui

source: Collapse here
pt_br: Colapsar aqui

source: Expand all
pt_br: Expandir todos

source: Collapse all
pt_br: Colapsar tudo

source: Add module
pt_br: Adicionar módulo

source: Delete module
pt_br: Remover módulo

source: Go to definition
pt_br: Ir para definição

source: Modules>> descrViewPopup: no selection
pt_br: Modules>> descrViewPopup: não há seleção

source: Insert in buffer
pt_br: Inserir no buffer

source: >>>Info Changed!!!
pt_br: >>>Informação Alterada!!!

source: categories: %s
pt_br: categorias: %s

source: This should never be shown!
pt_br: Isto nunca deveria ser mostrado!

source: Are you sure?
pt_br: Você tem certeza?

source: _Delete Module
pt_br: _Deletar Módulo

source: No package description
pt_br: Sem descrição de pacote

source: Not a valid module name : %s
pt_br: Nome de módulo inválido: %s

source: File already exists! Importing existing file %s.hs
pt_br: Arquivo já existe! Importando arquivo existente %s.hs

source: Construct new module
pt_br: Construir novo modulo

source: New module
pt_br: Novo módulo

source: Root of the source path
pt_br: Raiz do caminho de fontes

source: Is this an exposed library module
pt_br: Este módulo é uma biblioteca exposta?

source: Select root folder for package
pt_br: Selecione o diretório raiz para pacote

source: Select cabal package file (.cabal)
pt_br: Selecione o arquivo de pacote cabal (.cabal)

source: Cabal file with configurations can't be edited with the current version of the editor
pt_br: Arquivo cabal com configurações não pode ser editado com a versão atual do editor

source: Cabal file with tests of this type can't be edited with the current version of the editor
pt_br: Arquivos cabal com testes deste tipo não podem ser editados com a versão atual do editor

source: There is already file %s in this directory. Would you like to add this package to the workspace?
pt_br: O arquivo %s já existe neste diretório. Você gostaria de adicionar este pacote à área de trabalho?

source: _Add Package
pt_br: _Adicionar Pacote

source: The path you have choosen %s is not an empty directory. Are you sure you want to make a new package here?
pt_br: O caminho escolhido %s não é um diretório vazio. Você tem certeza que deseja criar um novo pacote aqui?

source: _Make Package Here
pt_br: _Criar Pacote Aqui

source: Setup.(l)hs does not exist. Writing Standard
pt_br: Setup.(l)hs não existe. Escrevendo o Padrão

source: Setup.(l)hs already exist
pt_br: Setup.(l)hs já existe!

source: Add Build Info
pt_br: Adicionar Informação de Build

source: Remove Build Info
pt_br: Remover Informação de Build

source: Unnamed
pt_br: Sem nome

source: Content doesn't validate
pt_br: Conteúdo não é válido

source: Just one Build Info
pt_br: Apenas uma Informação de Build

source: Unsaved changes. Close anyway?
pt_br: Há mudanças não salvas. Fechar assim mesmo?

source: Synopsis
pt_br: Sinopse

source: A one-line summary of this package
pt_br: Um resumo deste pacote em uma linha

source: Package Identifier
pt_br: Identificador do Pacote

source: A more verbose description of this package
pt_br: Uma descrição mais verbosa deste pacote

source: Package URL
pt_br: URL do Pacote

source: Category
pt_br: Categoria

source: Stability
pt_br: Estabilidade

source: License
pt_br: Licença

source: License File
pt_br: Arquivo de Licença

source: Select file
pt_br: Selecionar arquivo

source: Author
pt_br: Autor

source: Maintainer
pt_br: Mantenedor

source: Bug Reports
pt_br: Relatórios de bugs

source: Dependencies
pt_br: Dependências

source: Build Dependencies
pt_br: Dependências de construção

source: Does this package depends on other packages?
pt_br: Este pacote depende de outros pacotes?

source: Cabal version
pt_br: Versão do Cabal

source: Does this package depends on a specific version of Cabal?
pt_br: Este pacote depende de uma versão específica do Cabal?

source: Tested with compiler
pt_br: Testado com compilador

source: Data Files
pt_br: Arquivos de Dados

source: A list of files to be installed for run-time use by the package.
pt_br: Uma lista de arquivos a serem instalados para uso pelo pacote em tempo de execução

source: Select File
pt_br: Selecione Arquivo

source: Data directory
pt_br: Diretório de dados

source: Extra Files
pt_br: Arquivos Extras

source: Extra Source Files
pt_br: Arquivos-fonte Extras

source: A list of additional files to be included in source distributions.
pt_br: Uma lista de arquivos adicionais a serem incluídos na distribuição de fontes

source: Extra Tmp Files
pt_br: Arquivos Temporários Extras

source: A list of additional files or directories to be removed by setup clean.
pt_br: Uma lista de arquivos ou diretórios adicionais a serem removidos pela limpeza de instalação.

source: Other
pt_br: Outro

source: Build Type
pt_br: Tipo de Construção

source: Describe executable programs contained in the package
pt_br: Descreva programas executáveis contidos no pacote

source: Specify?
pt_br: Especificar?

source: Custom Fields
pt_br: Campos Personalizados

source: Name
pt_br: Nome

source: Value
pt_br: Valor

source: Executables
pt_br: Executáveis

source: Tests
pt_br: Testes

source: Describe tests contained in the package
pt_br: Descreva testes contidos no pacote

source: Library
pt_br: Biblioteca

source: If the package contains a library, specify the exported modules here
pt_br: Se o pacote contém uma biblioteca, especifique os módulos exportados aqui

source: Specify exported modules
pt_br: Especifique módulos exportados

source: Does this package contain a library?
pt_br: Este pacote contém uma biblioteca?

source: %s Build Info
pt_br: %s Informação de Construção

source: Component is buildable here
pt_br: Componente é construível aqui

source: Where to look for the source hierarchy
pt_br: Onde procurar a hierarquia de arquivos-fonte

source: Root directories for the source hierarchy.
pt_br: Diretórios raiz para a hierarquia de fontes

source: Select folder
pt_br: Selecione pasta

source: Non-exposed or non-main modules
pt_br: Módulos não-expostos ou sem main

source: A list of modules used by the component but not exposed to users.
pt_br: Uma lista de módulos usados pelo componente mas não expostos para usuários

source: %s Compiler
pt_br: %s Compilador

source: Options for haskell compilers
pt_br: Opções para compiladores haskell

source: Compiler Flavor
pt_br: Tipo de Compilador

source: Options
pt_br: Opções

source: Additional options for GHC when built with profiling
pt_br: Opções adicionais para o GHC quando constrúido com profiling

source: Additional options for GHC when the package is built as shared library
pt_br: Opções adicionais para o GHC quando o pacote é construído como biblioteca compartilhada

source: %s Extensions
pt_br: %s Extensões

source: Extensions
pt_br: Extensões

source: A list of Haskell extensions used by every module.
pt_br: Uma lista de extensões de Haskell usadas por cada módulo

source: %s Build Tools
pt_br: %s Ferramentas de construção

source: Tools needed for a build
pt_br: Ferramentas necessárias para construção

source: A list of pkg-config packages, needed to build this package
pt_br: Uma lista de pacotes pkg-config, necessários para construir este pacote

source: Options for C compiler
pt_br: Opções para compilador C

source: Options for linker
pt_br: Opções para ligador

source: A list of header files to use when compiling
pt_br: Uma lista de arquivos de header usados quando compilando

source: A list of header files to install
pt_br: Uma lista de arquivos de header para instalar

source: A list of directories to search for header files
pt_br: Uma lista de diretórios para procurar por arquivos de header

source: Select Folder
pt_br: Selecionar pasta

source: A list of C source files to be compiled,linked with the Haskell files.
pt_br: Uma lista de arquivos-fonte C a serem compilados e ligados com arquivos Haskell.

source: A list of extra libraries to link with
pt_br: Uma lista de bibliotecas extras para linkar com

source: A list of directories to search for libraries.
pt_br: Uma lista de diretórios para procurar por bibliotecas

source: %s Other
pt_br: %s Outro

source: Options for C preprocessor
pt_br: Opções para o pre-processador C

source: Support frameworks for Mac OS X
pt_br: Frameworks de suporte para Mac OS X

source: Custom fields build info
pt_br: Campos customizados

source: Version
pt_br: Versão

source: Version Range
pt_br: Conjunto de versões

source: Select compiler
pt_br: Selecione compilador

source: Specify compiler
pt_br: Especificar compilador

source: Select
pt_br: Selecionar

source: Unknown
pt_br: Desconhecido

source: Exposed
pt_br: Exposto

source: Is the lib to be exposed by default?
pt_br: Essa biblioteca deve ser exposta por padrão?

source: Exposed Modules
pt_br: Módulos Expostos

source: Build Info
pt_br: Informação de Construção

source: Executable Name
pt_br: Nome do Executável

source: Module Path
pt_br: Caminho do Módulo

source: Build info index
pt_br: Índice de informação de construção

source: File with main function
pt_br: Arquivo com função main

source: Test Name
pt_br: Nome do Teste

source: Package Flags
pt_br: Flags do Pacote

source: Config flags
pt_br: Flags de configuração

source: Build flags
pt_br: Flags de construção

source: Test flags
pt_br: Flags de teste

source: Haddock flags
pt_br: Flags do Haddock

source: Executable flags
pt_br: Flags do executável

source: Install flags
pt_br: Flags de instalação

source: Register flags
pt_br: Registrar flags

source: Unregister flags
pt_br: Remover flags

source: Source Distribution flags
pt_br: Flags da distribuição do código fonte

source: Prefs
pt_br: Preferências

source: Version number of preferences file format
pt_br: Número de versão do formato de arquivo de preferências

source: Integer
pt_br: Inteiro

source: Time of last storage
pt_br: Hora do último armazenamento

source: Show line numbers
pt_br: Mostrar números das linhas

source: (True/False)
pt_br: (Verdadeiro/Falso)

source: TextView Font
pt_br: Fonte do TextView

source: Right margin
pt_br: Margem à direita

source: Size or 0 for no right margin
pt_br: Tamanho ou 0 para nenhuma margem

source: Position
pt_br: Posição

source: Show it ?
pt_br: Mostrar?

source: Tab width
pt_br: Comprimento da tabulação

source: Wrap lines
pt_br: Quebrar linhas

source: Use standard line ends even on windows
pt_br: Usar quebras de linha padrão mesmo no Windows

source: Remove trailing blanks when saving a file
pt_br: Remover espaços em branco restantes quando salvar arquivo

source: Source candy
pt_br: Código açucarado (candy)

source: Empty for do not use or the name of a candy file in a config dir
pt_br: Vazio pois não utilize o nome de um arquivo candy em um diretório de configuração

source: Candy specification
pt_br: Especificação de Candy

source: Use it ?
pt_br: Usar?

source: Editor Style
pt_br: Estilo do Editor

source: classic
pt_br: clássico

source: Found Text Background
pt_br: Área de fundo para texto encontrado

source: Execution Context Text Background
pt_br: Área de fundo para contexto de execução

source: Breakpoint Text Background
pt_br: Área de fundo para breakpoint

source: Automatically load modified files modified outside of Leksah
pt_br: Carregar automaticamente arquivos modificados fora do Leksah

source: Use Yi - Experimental feature (could wipe your files)
pt_br: Usar Yi - Funcionalidade experimental (pode destruir seus arquivos)

source: GUI Options
pt_br: Opções de GUI

source: LogView Font
pt_br: Fonte do LogView

source: Window default size
pt_br: Tamanho padrão da janela

source: Default size of the main ide window specified as pair (int,int)
pt_br: Tamanho padrão da janela principal da IDE, especificado como um par (Int,Int)

source: Use ctrl Tab for Notebook flipper
pt_br: Use ctrl Tab para passar folhas.

source: Complete only on Hotkey
pt_br: Completar apenas com hotkey

source: Name of the keymap
pt_br: Nome do mapa de teclado

source: The name of a keymap file in a config dir
pt_br: O nome do arquivo de mapa de teclado em um diretório de configuração

source: Initial Pane positions
pt_br: Posição inicial de painel

source: Categories for panes
pt_br: Categorias para painéis

source: Pane Id
pt_br: Id do Panel

source: Pane Category
pt_br: Categoria do Painel

source: Pane path for category
pt_br: Caminho do painel para categoria

source: Pane category
pt_br: Categoria do painel

source: Pane path
pt_br: Caminho do painel

source: Default pane path
pt_br: Caminho de painel padrão

source: Metadata
pt_br: Metadados

source: Paths under which haskell sources for packages may be found
pt_br: Caminhos onde fontes haskell para pacotes podem ser encontrados

source: Unpack source for cabal packages to
pt_br: Desempacotar arquivos-fonte de pacotes cabal para

source: URL from which to download prebuilt metadata
pt_br: URL de onde se obtem metadados pré-construídos

source: Strategy for downloading prebuilt metadata
pt_br: Estratégia para obter metadados pré-construídos

source: Try to download and then build locally if that fails
pt_br: Tentar baixar e, então, construir localmente se isso falhar

source: Try to build locally and then download if that fails
pt_br: Tentar construir localmente e, então, baixar se isso falhar

source: Never download (just try to build locally)
pt_br: Nunca baixar (apenas tentar construir localmente)

source: Update metadata at startup
pt_br: Atualizar metadados durante inicialização

source: Port number for leksah to comunicate with leksah-server
pt_br: Número da porta para leksah se comunicar com leksah-server

source: IP address for leksah to comunicate with leksah-server
pt_br: Enderço IP para leksah se comunicar com leksah-server

source: Stop the leksah-server process when leksah disconnects
pt_br: Parar o processo leksah-server quando leksah desconectar

source: Packages which are excluded from the modules pane
pt_br: Pacotes que estão excluídos do painel de módulos

source: Build
pt_br: Construir

source: Automatically save all files before building
pt_br: Salvar todos os arquivos automaticamente antes de construir

source: Select first warning if built without errors
pt_br: Selecionar o primeiro aviso se construir sem erros

source: Background build
pt_br: Construir em background

source: Run unit tests when building
pt_br: Executar testes unitários quando construir

source: Make mode
pt_br: Modo de Make

source: Single mode
pt_br: Modo individual

source: Single build without linking
pt_br: Construção individual sem linking

source: Don't install last package
pt_br: Não instalar último pacote

source: Debug
pt_br: Depurar

source: Enable usage of Show instances in :print
pt_br: Habilitar uso de instâncias de Show em :print

source: Break on any exception thrown
pt_br: Parar em qualquer excessão lançada

source: Break on uncaught exceptions and errors
pt_br: Parar em excessões não tratadas e erros

source: Turn on printing of binding results in GHCi
pt_br: Habilitar exibição de resultados de binding no GHCi

source: Help
pt_br: Ajuda

source: Browser
pt_br: Navegador

source: URL for searching documentation
pt_br: URL para procurar documentação

source: Select a special style?
pt_br: Selecionar um estilo especial?

source: Search
pt_br: Buscar

source: Exact
pt_br: Exato

source: Prefix
pt_br: Prefixo

source: Case sensitive
pt_br: Sensível a maiúsculas

source: Symbol
pt_br: Símbolo

source: Type/Kind
pt_br: Tipo/Espécie

source: Search >> listViewPopup: no selection
pt_br: Busca>> listViewPopup: sem seleção

source: Search >> selectDescr: invalid path
pt_br: Busca>> selectDescr: caminho inválido

source: File path not found
pt_br: Caminho de arquivo não encontrado

source: File does not exist
pt_br: Arquivo não existe

source: Auto Loading
pt_br: Carregar automaticamente

source: " has changed on disk.
pt_br: " foi alterado no disco.

source: _Load From Disk
pt_br: _Carregar do Disco

source: _Always Load From Disk
pt_br: _Sempre Carregar do Disco

source: _Don't Load
pt_br: _Não Carregar

source: fileSave: Page not found
pt_br: fileSave: Página não encontrada

source: Save File
pt_br: Salvar Arquivo

source: File already exist.
pt_br: Arquivo já existe

source: _Overwrite
pt_br: _Sobreescrever

source: Save changes to document:
pt_br: Salvar mudanças para documento:

source: _Save
pt_br: _Salvar

source: _Don't Save
pt_br: _Não Salvar

source: notebook page not found: unexpected
pt_br: página de caderno não encontrada: inesperado

source: Open File
pt_br: Abrir Arquivo

source: Buffer already open.
pt_br: Buffer já está aberto.

source: Make _Active
pt_br: Tornar _Ativo

source: _Open Second
pt_br: _Abrir Segundo

source: Index
pt_br: Índice

source: Function
pt_br: Função

source: trace parse error %s\ninput: %s
pt_br: trace erros de parsing %s\ninput: %s

source: Back
pt_br: Voltar

source: Forward
pt_br: Avançar

source: Empty history.
pt_br: Histórico vazio.

source: <end of history>
pt_br: <fim do histórico>

source: Not stopped at a breakpoint
pt_br: Não parou em um breakpoint

source: traces parser
pt_br: trace em parser

source: trace parser
pt_br: trace de parser

source: Variables
pt_br: Variáveis

source: Type
pt_br: Tipo

source: Force
pt_br: Forçar

source: Print
pt_br: Imprimir

source: Active
pt_br: Ativo

source: File path
pt_br: Caminho do arquivo

source: Activate Package
pt_br: Ativar Pacote

source: Add Package
pt_br: Adicionar Pacote

source: Remove Package
pt_br: Remover Pacote

source: Workspace >> workspaceSelect: invalid path
pt_br: Workspace >> workspaceSelect: caminho invaálido

source: Version Con_trol
pt_br: Con_trole de Versão

source: _Print File
pt_br: _Imprimir Arquivo

source: _File
pt_br: _Arquivo

source: _New Module...
pt_br: _Novo Módulo...

source: _New Text File
pt_br: _Novo Arquivo Texto

source: _Open...
pt_br: _Abrir...

source: Open _Recent
pt_br: Abrir _Recente

source: _Revert
pt_br: _Reverter

source: Save _As...
pt_br: Salvar _Como...

source: Save A_ll
pt_br: Salvar _Todos

source: _Close
pt_br: _Fechar

source: Close All
pt_br: Fechar Todos

source: Close All But Package
pt_br: Fechar Todos Exceto Pacote

source: Close All But Workspace
pt_br: Fechar Todos Menos a Área de Trabalho

source: _Quit
pt_br: _Sair

source: _Edit
pt_br: _Editar

source: _Undo
pt_br: _Desfazer

source: _Redo
pt_br: _Refazer

source: Cu_t
pt_br: Recor_tar

source: _Copy
pt_br: _Copiar

source: _Paste
pt_br: _Colar

source: _Delete
pt_br: _Deletar

source: Select_All
pt_br: Selecionar_Tudo

source: Find
pt_br: Buscar

source: Find _Next
pt_br: Buscar _Próximo

source: Find _Previous
pt_br: Buscar _Anterior

source: _Goto Line
pt_br: _Ir para a linha

source: _Comment
pt_br: _Comentar

source: _Uncomment
pt_br: _Descomentar

source: Shift _Right
pt_br: Shift à _Direita

source: Shift _Left
pt_br: Shift à _Esquerda

source: Align _=
pt_br: Alinhar _=

source: Align -_>
pt_br: Alinhar -_>

source: Align _<-
pt_br: Alinhar _<-

source: Align _::
pt_br: Alinhar _::

source: _Workspace
pt_br: _Área de Trabalho

source: _New...
pt_br: _Novo...

source: Cl_ean
pt_br: _Limpar

source: Cleans all packages
pt_br: Limpar todos os pacotes

source: Makes all of this workspace
pt_br: Make em tudo nesta área de trabalho

source: _Next Error
pt_br: _Próximo Erro

source: Go to the next error
pt_br: Ir para o próximo erro

source: _Previous Error
pt_br: _Erro Anterior

source: Go to the previous error
pt_br: Ir para erro anterior

source: _Package
pt_br: _Pacote

source: _Add...
pt_br: _Adicionar...

source: Edit Flags
pt_br: Editar Flags

source: Edit the package flags
pt_br: Editar flags do pacote

source: Cleans the package
pt_br: Limpa o pacote

source: _Configure
pt_br: _Configurar

source: Configures the package
pt_br: Configura o pacote

source: _Build
pt_br: _Construir

source: Builds the package
pt_br: Constrói o pacote

source: _Build Documentation
pt_br: _Construir Documentação

source: Builds the documentation
pt_br: Constrói a documentação

source: Copies the package
pt_br: Copia o pacote

source: _Run
pt_br: _Executar

source: Runs the package
pt_br: Executa o pacote

source: Resol_ve Errors
pt_br: Resol_ver Erros

source: Resolve 'Hidden package' and 'Not in scope' errors by adding the necessary dependancies or imports
pt_br: Resolver erros de 'Pacote escondido' ou 'Fora de escopo' com adição das dependências ou importações necessárias

source: _Install Dependencies
pt_br: _Instalar Dependências

source: Install the package's dependencies from the hackage server
pt_br: Instalar dependências do pacote pelo servidor hackage

source: _Register
pt_br: _Registrar

source: Test
pt_br: Testar

source: Source Dist
pt_br: Distribuição de Fontes

source: _Open Doc
pt_br: _Abrir Documentação

source: _Debug
pt_br: _Depurar

source: _Start Debugger
pt_br: _Inicializar Depurador

source: Starts using the GHCi debugger for build and run
pt_br: Passa a usar o depurador GHCi para construção e execução

source: _Quit Debugger
pt_br: _Sair do Depurador

source: Quit the GHCi debugger if it is running
pt_br: Sair do depurador GHCi se estiver em execução

source: _Execute Selection
pt_br: _Executar Seleção

source: Sends the selected text to the debugger
pt_br: Envia o texto selecionado para o depurador

source: Set Breakpoint
pt_br: Criar breakpoint

source: Set a breakpoint on the selected name or current line
pt_br: Criar breakpoint no nome selecionado ou na linha atual

source: Show Next Breakpoint
pt_br: Mostrar Próximo Breakpoint

source: Show the next breakpoint
pt_br: Mostrar o próximo breakpoint

source: Show Previous Breakpoint
pt_br: Mostrar Breakpoint Anterior

source: Show the previous breakpoint
pt_br: Mostrar o breakpoint anterior

source: Delete All Breakpoints
pt_br: Deletar Todos os Breakpoints
