Repository: leksah/leksah
Catalog: po/*.po
Languages: pt_br

source: Continue
pt_br: Continuar

source: Resume after a breakpoint
pt_br: Continuar após breakpoint

source: Abandon
pt_br: Abandonar

source: At a breakpoint, abandon current computation
pt_br: Em um breakpoint, abandonar a computação atual

source: Stop
pt_br: Parar

source: Interrupt the running operation.
pt_br: Interromper a operação em execução

source: Step
pt_br: Passo

source: Single-step after stopping at a breakpoint
pt_br: Passo-simples após parar em breakpoint

source: Step Expression
pt_br: Expressão de Passo

source: Single-step into selected expression
pt_br: Passo-simples para a expressão selecionada

source: Step Local
pt_br: Passo Local

source: Single-step within the current top-level binding
pt_br: Passo-simples dentro dos bindings de maior nível atuais

source: Step Module
pt_br: Passo de Módulo

source: Single-step restricted to the current module
pt_br: Passo-simples restrito ao módulo atual

source: Trace after stopping at a breakpoint
pt_br: Trace após interromper em um breakpoint

source: Trace Expression
pt_br: Expressão de Trace

source: Evaluate the selected expression with tracing on
pt_br: Avaliar a expressão selecionada com trace ativado

source: History
pt_br: Histórico

source: After 'Trace', show the execution history
pt_br: Após 'Trace', exibir histórico de execução

source: Go back in the history (after 'Trace')
pt_br: Voltar no histórico (após 'Trace')

source: Go forward in the history (after 'Back')
pt_br: Avançar no histórico (após 'Voltar')

source: Print the selected expression, forcing unevaluated parts
pt_br: Imprime a expressão selecionada, forçando partes não ainda avaliadas

source: Prints a value without forcing its computation
pt_br: Imprime um valor sem forçar sua computação

source: SimplePrint
pt_br: Impressão Simples

source: Simplifed version of Print
pt_br: Versão simplificada de Imprimir

source: Show Bin_dings
pt_br: Exibir Bin_dings

source: Show the current bindings
pt_br: Mostrar os bindings atuais

source: Show _Breakpoints
pt_br: Exibir _Breakpoints

source: Show the active breakpoints
pt_br: Exibir os breakpoints ativos

source: Show _Context
pt_br: Exibir _Contexto

source: Show the breakpoint context
pt_br: Exibe o contexto do breakpoint

source: Show Loaded _Modules
pt_br: Exibir _Módulos Carregados

source: Show the currently loaded modules
pt_br: Exibe os módulos carregados no momento

source: Show _Packages
pt_br: Exibir _Pacotes

source: Show the currently active packages
pt_br: Exibe os pacotes ativos no momento

source: Show _Languages
pt_br: Exibir _Linguagens

source: Show the currently active language
pt_br: Exibe as flags de linguagem ativas no momento

source: Information
pt_br: Informação

source: Display information about the selected name(s)
pt_br: Apresentar informação sobre o(s) nome(s) selecionado(s)

source: Kind
pt_br: Espécie

source: Show the kind of the selected type
pt_br: Mostrar a espécie do tipo selecionado

source: Show the type of the selected expression
pt_br: Mostrar o tipo da expressão selecionada

source: _Metadata
pt_br: _Metadados

source: _Update workspace data
pt_br: _Atualizar dados da área de trabalho

source: Updates data for the current workspace
pt_br: Atualiza dados para a área de trabalho atual

source: _Rebuild workspace data
pt_br: _Reconstruir dados da área de trabalho

source: Rebuilds data for the current workspace
pt_br: Reconstroi os dados da área de trabalho atual

source: U_pdate system data
pt_br: A_tualizar dados do sistema

source: R_ebuild system data
pt_br: R_econstruir dados do sistema

source: _Session
pt_br: _Sessão

source: _Save Session
pt_br: _Salvar Sessão

source: _Load Session
pt_br: _Carregar Sessão

source: _Forget Session
pt_br: _Esquecer Sessão

source: _Panes
pt_br: _Painéis

source: Debugger
pt_br: Depurador

source: Documentation
pt_br: Documentação

source: _View
pt_br: _Exibir

source: Move _Left
pt_br: Mover para a _Esquerda

source: Move _Right
pt_br: Mover para a _Direita

source: Move _Up
pt_br: Mover para _Cima

source: Move _Down
pt_br: Mover para _Baixo

source: Split H_orizontal
pt_br: Dividir H_orizontalmente

source: Split _Vertical
pt_br: Dividir _Verticalmente

source: _Collapse
pt_br: _Colapsar

source: _Group
pt_br: A_grupar

source: _Detach
pt_br: _Destacar

source: _Full Screen
pt_br: _Tela Cheia

source: _Exit Full Screen
pt_br: _Sair de Tela Cheia

source: Dark
pt_br: Escuro

source: Light
pt_br: Claro

source: Tabs Left
pt_br: Tabs à Esquerda

source: Tabs Right
pt_br: Tabs à Direita

source: Tabs Up
pt_br: Tabs acima

source: Tabs Down
pt_br: Tabs abaixo

source: Tabs On/Off
pt_br: Tabs ativado/desativado

source: Close pane
pt_br: Fechar painel

source: Flip down
pt_br: Flip abaixo

source: Flip up
pt_br: Flip acima

source: StartComplete
pt_br: Iniciar Preenchimento

source: _Clear Log
pt_br: _Limpar Log

source: Toggle Toolbar
pt_br: Acionar Toolbar

source: _Configuration
pt_br: _Configuração

source: _To Candy
pt_br: _Para Candy

source: _Edit Prefs
pt_br: _Editar Preferências

source: _Help
pt_br: _Ajuda

source: About
pt_br: Sobre

source: _BackgroundBuild
pt_br: _Construção em segundo plano

source: Build in the background and report errors
pt_br: Construir em segundo plano e reportar erros

source: _RunUnitTests
pt_br: _Rodar testes unitários

source: _MakeMode
pt_br: _ModoMake

source: Make dependent packages
pt_br: Make dependências de pacote

source: Use GHCi debugger to build and run
pt_br: Usar depurador GHCi para construir e executar

source: _OpenDocu
pt_br: _AbrirDocu

source: Opens a browser for a search of the selected data
pt_br: Abre um navegador para uma busca dos dados selecionados.

source: Menu>>makeMenu: failed to create menubar
pt_br: Menu>>makeMenu: falha ao criar barra de menu

source: Menu>>makeMenu: failed to create toolbar
pt_br: Menu>>makeMenu: falha ao criar barra de ferramentas

source: Eval
pt_br: Avaliar

source: Eval & Insert
pt_br: Avaliar & Inserir

source: Find (text)
pt_br: Pesquisar (texto)

source: Search (metadata)
pt_br: Buscar (metadados)

source: Select a text first
pt_br: Selecione texto primeiro

source: An integrated development environement (IDE) for the
pt_br: Um ambiente de desenvolvimento integrado (IDE) para a

source: programming language Haskell and the Glasgow Haskell Compiler
pt_br: linguagem de programação Haskell e o compilador Glasgow

source: Can't load icons from %s %s
pt_br: Não é possível carregar ícones de %s %s

source: Can't find UI Action %s
pt_br: UI Action %s não encontrada

source: Configuring
pt_br: Configurando

source: Can't read package file
pt_br: Não é possível ler arquivo de pacote

source: Building
pt_br: Construindo

source: Run the 'configure' command first
pt_br: Execute o comando 'configure' primeiro

source: please re-configure
pt_br: favor re-configurar

source: cannot satisfy -package-id
pt_br: Não foi possível satisfazer -pacote-id

source: Documenting
pt_br: Documentando

source: Cleaning
pt_br: Limpando

source: Select the target directory
pt_br: Selecione o diretório alvo

source: Copying
pt_br: Copiando

source: Installing
pt_br: Instalando

source: Running %s
pt_br: Executando %s

source: no executable in selected package
pt_br: nenhum executável no pacote selecionado

source: Registering
pt_br: Registrando

source: Testing
pt_br: Testando

source: Opening Documentation
pt_br: Abrindo Documentação

source: No active package
pt_br: Nenhum pacote ativo

source: Can't load package
pt_br: Não foi possível carregar pacote

source: Couldn't read template file: %s
pt_br: Não foi possível ler arquivo template: %s

source: Can't update package
pt_br: Não foi possível atualizar pacote

source: Cabal file with configurations can't be automatically updated with the current version of Leksah
pt_br: Arquivos cabal com configurações não podem ser atualizados automaticamente com a versão atual do Leksah

source: Can't upade package
pt_br: Não foi possível atualizar pacote

source: Debugger already running
pt_br: Depurador já está em execução

source: GHCi debugger is not running.
pt_br: Depurador GHCi não está em execução.

source: _Start GHCi
pt_br: _Iniciar GHCi

source: Can't activate package
pt_br: Não foi possível ativar pacote

source: Version of session file format
pt_br: Versão do formato de arquivo de sessão

source: Time of storage
pt_br: Horário do armazenamento

source: Population
pt_br: População

source: Window size
pt_br: Tamanho da janela

source: Completion size
pt_br: Tamanho do preenchimento

source: Active pane
pt_br: Painel ativo

source: Toolbar visible
pt_br: Barra de ferramentas visível

source: Recently opened files
pt_br: Arquivos recentes

source: Recently opened workspaces
pt_br: Áreas de trabalho recentes

source: Forget this session
pt_br: Esquecer desta sessão

source: Now saving session
pt_br: Salvando sessão agora

source: Save Session as
pt_br: Salvar Sessão como

source: Select session file
pt_br: Selecione arquivo de sessão

source: apply Layout can only be allied to empty Layout
pt_br: aplicar Layout só pode ser usado com Layout vazio

source: New file for workspace
pt_br: Novo arquivo para área de trabalho

source: No workspace open
pt_br: Nenhuma área de trabalho aberta

source: You need to have a workspace open for this to work.
pt_br: É necessário uma área de trabalho aberta para isto funcionar.

source: Choose ~/leksah.lkshw to
pt_br: Escolha ~/leksah.lkshw para

source: open workspace
pt_br: abrir área de trabalho

source: create a workspace
pt_br: criar área de trabalho

source: _New Workspace
pt_br: _Nova Área de Trabalho

source: _Open Workspace
pt_br: _Abrir Área de Trabalho

source: Select leksah workspace file (.lkshw)
pt_br: Selecione arquivo de área de trabalho do leksah (.lkshw)

source: There are session settings stored with this workspace.
pt_br: Há configurações de sessão armazenadas nesta área de trabalho

source: _Ignore Session
pt_br: _Ignorar Sessão

source: Can't load workspace file %s\n%s
pt_br: Não é possível carregar arquivo de área de trabalho %s\n%s

source: You need to have an active package for this to work.
pt_br: Você precisa ter um pacote ativo para isto funcionar.

source: _New Package
pt_br: _Novo Pacote

source: No workspace for build.
pt_br: Não há área de trabalho para se construir.
